hl7_2_ada/ketenzorg/3.0.1/beschikbaarstellen/hl7v3_instance/hl7v3_allergieintoleranties_bundle_01.xml

<?xml version="1.0" encoding="UTF-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/' xmlns:s='http://www.w3.org/2001/XMLSchema' xmlns:wss='http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.0.xsd' >
    <SOAP-ENV:Body>
        <MCCI_IN200101 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <id extension="114610" root="2.16.840.1.113883.2.4.6.6.1.1.33"/>
            <creationTime value="20181127115834"/>
            <versionCode code="NICTIZEd2005-Okt"/>
            <interactionId extension="MCCI_IN200101" root="2.16.840.1.113883.1.6"/>
            <profileId extension="810" root="2.16.840.1.113883.2.4.3.11.1"/>
            <transmissionQuantity value="3"/>
            <acknowledgement typeCode="AA">
                <targetTransmission>
                    <id extension="34745ef4-6429-4142-8efc-99e4714e887e" root="2.16.528.1.1007.3.3.1234567.1"/>
                </targetTransmission>
            </acknowledgement>
            <receiver>
                <device>
                    <id extension="4003" root="2.16.840.1.113883.2.4.6.6"/>
                </device>
            </receiver>
            <sender>
                <device>
                    <id extension="1" root="2.16.840.1.113883.2.4.6.6"/>
                </device>
            </sender>
            <REPC_IN990131NL xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <id extension="114611" root="2.16.840.1.113883.2.4.6.6.1.1.33"/>
                <creationTime value="20181127115834"/>
                <versionCode code="NICTIZEd2005-Okt"/>
                <interactionId extension="REPC_IN990131NL" root="2.16.840.1.113883.1.6"/>
                <profileId extension="810" root="2.16.840.1.113883.2.4.3.11.1"/>
                <processingCode code="P"/>
                <processingModeCode code="T"/>
                <acceptAckCode code="NE"/>
                <acknowledgement typeCode="AE">
                    <targetMessage>
                        <id extension="34745ef4-6429-4142-8efc-99e4714e887e" root="2.16.528.1.1007.3.3.1234567.1"/>
                    </targetMessage>
                </acknowledgement>
                <receiver>
                    <device>
                        <id extension="4003" root="2.16.840.1.113883.2.4.6.6"/>
                    </device>
                </receiver>
                <sender>
                    <device>
                        <id extension="1" root="2.16.840.1.113883.2.4.6.6"/>
                    </device>
                </sender>
                <ControlActProcess moodCode="EVN">
                    <effectiveTime value="20181127115834"/>
                    <authorOrPerformer typeCode="AUT">
                        <participant>
                            <AssignedDevice>
                                <id extension="1" root="2.16.840.1.113883.2.4.6.6"/>
                            </AssignedDevice>
                        </participant>
                    </authorOrPerformer>
                    <reasonOf>
                        <justifiedDetectedIssue>
                            <code code="AUTERR_SWV_FALSE" codeSystem="2.16.840.1.113883.2.4.6.6.1.1000" displayName="Er zijn gegevens beschikbaar buiten uw samenwerkingsverband/regio bij zorgaanbieder  (URA: 00003232)"/>
                        </justifiedDetectedIssue>
                    </reasonOf>
                    <queryAck>
                        <queryId extension="KZ_29a3bec1-2009-40c1-b137-060a06aab3db" root="2.16.528.1.1007.3.1.1009.1"/>
                        <queryResponseCode code="AE"/>
                        <resultTotalQuantity value="0"/>
                        <resultCurrentQuantity value="0"/>
                        <resultRemainingQuantity value="0"/>
                    </queryAck>
                </ControlActProcess>
            </REPC_IN990131NL>
            <REPC_IN990131NL xmlns="urn:hl7-org:v3" xsi:schemaLocation="urn:hl7-org:v3 ../schemas/REPC_IN990131NL.xsd" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <id extension="6" root="2.16.840.1.113883.2.4.6.6.1.1"/>
                <creationTime value="20181127115834"/>
                <versionCode code="NICTIZEd2005-Okt"/>
                <interactionId extension="REPC_IN990131NL" root="2.16.840.1.113883.1.6"/>
                <profileId root="2.16.840.1.113883.2.4.3.11.1" extension="810"/>
                <processingCode code="P"/>
                <processingModeCode code="T"/>
                <acceptAckCode code="NE"/>
                <acknowledgement typeCode="AA">
                    <targetMessage>
                        <id extension="114607" root="2.16.840.1.113883.2.4.6.6.1.1.33"/>
                    </targetMessage>
                </acknowledgement>
                <receiver>
                    <device classCode="DEV" determinerCode="INSTANCE">
                        <id root="2.16.840.1.113883.2.4.6.6" extension="1"/>
                    </device>
                </receiver>
                <sender>
                    <device classCode="DEV" determinerCode="INSTANCE">
                        <id extension="70000020" root="2.16.840.1.113883.2.4.6.6"/>
                    </device>
                </sender>
                <ControlActProcess moodCode="EVN">
                    <authorOrPerformer typeCode="AUT">
                        <participant>
                            <AssignedDevice>
                                <id extension="900017439" root="2.16.528.1.1007.3.2"/>
                                <id extension="70000003" root="2.16.840.1.113883.2.4.6.6"/>
                                <Organization>
                                    <id extension="00002727" root="2.16.528.1.1007.3.3"/>
                                    <name>VZVZ Simulator 70000003</name>
                                </Organization>
                            </AssignedDevice>
                        </participant>
                    </authorOrPerformer>
                    <subject>
                        <organizer classCode="CLUSTER" moodCode="EVN">
                            <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.20"/>
                            <code code="48765-2" displayName="Allergies and/or adverse reactions" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC"/>
                            <statusCode code="completed"/>
                            <recordTarget typeCode="RCT" contextControlCode="OP">
                                <patientRole>
                                    <id root="2.16.840.1.113883.2.4.6.3" extension="999900006"/>
                                    <patient>
                                        <name>
                                            <given>L</given>
                                            <family>XXX_Charan</family>
                                        </name>
                                        <administrativeGenderCode code="M" codeSystem="2.16.840.1.113883.5.1"/>
                                    </patient>
                                </patientRole>
                            </recordTarget>
                            <component typeCode="COMP" contextControlCode="OP">
                                <act classCode="ACT" moodCode="EVN">
                                    <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.215"/>
                                    <id extension="ai6547382f.3786" root="2.16.528.1.1007.3.3.765332.1.12"/>
                                    <code code="CONC" codeSystem="2.16.840.1.113883.5.6" displayName="Concern"/>
                                    <statusCode code="active"/>
                                    <effectiveTime>
                                        <low value="20181120115834"/>
                                    </effectiveTime>
                                    <entryRelationship typeCode="SUBJ">
                                        <observation classCode="OBS" moodCode="EVN">
                                            <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.216"/>
                                            <id extension="66935281-de15-4033-9be4-a4127812dd95" root="2.16.528.1.1007.3.3.765332.1.12"/>
                                            <code code="ASSERTION" codeSystem="2.16.840.1.113883.5.4"/>
                                            <statusCode code="completed"/>
                                            <effectiveTime>
                                                <low value="20181120115834"/>
                                            </effectiveTime>
                                            <value xsi:type="CD" code="419199007" codeSystem="2.16.840.1.113883.6.96" displayName="Allergy to substance"/>
                                            <participant typeCode="CSM">
                                                <participantRole classCode="MANU">
                                                    <playingEntity classCode="MMAT">
                                                        <code nullFlavor="OTH">
                                                            <originalText>Amoxicilline, opmerking: via neuroloog</originalText>
                                                        </code>
                                                    </playingEntity>
                                                </participantRole>
                                            </participant>
                                        </observation>
                                    </entryRelationship>
                                </act>
                            </component>
                        </organizer>
                    </subject>
                    <queryAck>
                        <queryId extension="KZ_29a3bec1-2009-40c1-b137-060a06aab3db" root="2.16.528.1.1007.3.1.1009.1"/>
                        <queryResponseCode code="OK"/>
                        <resultTotalQuantity value="1"/>
                        <resultCurrentQuantity value="1"/>
                        <resultRemainingQuantity value="0"/>
                    </queryAck>
                </ControlActProcess>
            </REPC_IN990131NL>
            <REPC_IN990131NL xmlns="urn:hl7-org:v3" xsi:schemaLocation="urn:hl7-org:v3 ../schemas/REPC_IN990131NL.xsd" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <id extension="7" root="2.16.840.1.113883.2.4.6.6.1.1"/>
                <creationTime value="20181127115834"/>
                <versionCode code="NICTIZEd2005-Okt"/>
                <interactionId extension="REPC_IN990131NL" root="2.16.840.1.113883.1.6"/>
                <profileId root="2.16.840.1.113883.2.4.3.11.1" extension="810"/>
                <processingCode code="P"/>
                <processingModeCode code="T"/>
                <acceptAckCode code="NE"/>
                <acknowledgement typeCode="AA">
                    <targetMessage>
                        <id extension="114608" root="2.16.840.1.113883.2.4.6.6.1.1.33"/>
                    </targetMessage>
                </acknowledgement>
                <receiver>
                    <device classCode="DEV" determinerCode="INSTANCE">
                        <id root="2.16.840.1.113883.2.4.6.6" extension="1"/>
                    </device>
                </receiver>
                <sender>
                    <device classCode="DEV" determinerCode="INSTANCE">
                        <id extension="70000021" root="2.16.840.1.113883.2.4.6.6"/>
                    </device>
                </sender>
                <ControlActProcess moodCode="EVN">
                    <authorOrPerformer typeCode="AUT">
                        <participant>
                            <AssignedDevice>
                                <id extension="900017439" root="2.16.528.1.1007.3.2"/>
                                <id extension="70000003" root="2.16.840.1.113883.2.4.6.6"/>
                                <Organization>
                                    <id extension="00002727" root="2.16.528.1.1007.3.3"/>
                                    <name>VZVZ Simulator 70000003</name>
                                </Organization>
                            </AssignedDevice>
                        </participant>
                    </authorOrPerformer>
                    <subject>
                        <organizer classCode="CLUSTER" moodCode="EVN">
                            <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.20"/>
                            <code code="48765-2" displayName="Allergies and/or adverse reactions" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC"/>
                            <statusCode code="completed"/>
                            <recordTarget typeCode="RCT" contextControlCode="OP">
                                <patientRole>
                                    <id root="2.16.840.1.113883.2.4.6.3" extension="999900006"/>
                                    <patient>
                                        <name>
                                            <given>L</given>
                                            <family>XXX_Charan</family>
                                        </name>
                                        <administrativeGenderCode code="M" codeSystem="2.16.840.1.113883.5.1"/>
                                    </patient>
                                </patientRole>
                            </recordTarget>
                            <component typeCode="COMP" contextControlCode="OP">
                                <act classCode="ACT" moodCode="EVN">
                                    <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.215"/>
                                    <id extension="ai6547382f.3786" root="2.16.528.1.1007.3.3.765332.1.12"/>
                                    <code code="CONC" codeSystem="2.16.840.1.113883.5.6" displayName="Concern"/>
                                    <statusCode code="active"/>
                                    <effectiveTime>
                                        <low value="20181120115834"/>
                                    </effectiveTime>
                                    <entryRelationship typeCode="SUBJ">
                                        <observation classCode="OBS" moodCode="EVN">
                                            <templateId root="2.16.840.1.113883.2.4.3.11.60.66.10.216"/>
                                            <id extension="66935281-de15-4033-9be4-a4127812dd95" root="2.16.528.1.1007.3.3.765332.1.12"/>
                                            <code code="ASSERTION" codeSystem="2.16.840.1.113883.5.4"/>
                                            <statusCode code="completed"/>
                                            <effectiveTime>
                                                <low value="20181120115834"/>
                                            </effectiveTime>
                                            <value xsi:type="CD" code="419199007" codeSystem="2.16.840.1.113883.6.96" displayName="Allergy to substance"/>
                                            <participant typeCode="CSM">
                                                <participantRole classCode="MANU">
                                                    <playingEntity classCode="MMAT">
                                                        <code nullFlavor="OTH">
                                                            <originalText>Amoxicilline, opmerking: via neuroloog</originalText>
                                                        </code>
                                                    </playingEntity>
                                                </participantRole>
                                            </participant>
                                        </observation>
                                    </entryRelationship>
                                </act>
                            </component>
                        </organizer>
                    </subject>
                    <queryAck>
                        <queryId extension="KZ_29a3bec1-2009-40c1-b137-060a06aab3db" root="2.16.528.1.1007.3.1.1009.1"/>
                        <queryResponseCode code="OK"/>
                        <resultTotalQuantity value="1"/>
                        <resultCurrentQuantity value="1"/>
                        <resultRemainingQuantity value="0"/>
                    </queryAck>
                </ControlActProcess>
            </REPC_IN990131NL>
        </MCCI_IN200101>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>